## This file is to test only

In [1]:
%load_ext sql

In [2]:
%%sql
postgresql://dbproject_iccs225_user:A9rncGTMCtEM0SoC6t72eBsK6qiT7mde@dpg-ct5gtalds78s73bnqkag-a.singapore-postgres.render.com/dbproject_iccs225

## Create Table

In [14]:
%%sql
CREATE TABLE VehicleManagement (
    VehicleID SERIAL PRIMARY KEY,
    Brand VARCHAR(50) NOT NULL,
    ModelName VARCHAR(100) NOT NULL,
    Mileage INT NOT NULL,
    Price DECIMAL(10, 2) NOT NULL,
    Year INT NOT NULL
);

 * postgresql://dbproject_iccs225_user:***@dpg-ct5gtalds78s73bnqkag-a.singapore-postgres.render.com/dbproject_iccs225
(psycopg2.errors.DuplicateTable) relation "vehiclemanagement" already exists

[SQL: CREATE TABLE VehicleManagement (
    VehicleID SERIAL PRIMARY KEY,
    Brand VARCHAR(50) NOT NULL,
    ModelName VARCHAR(100) NOT NULL,
    Mileage INT NOT NULL,
    Price DECIMAL(10, 2) NOT NULL,
    Year INT NOT NULL
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [13]:
%%sql
INSERT INTO VehicleManagement (Brand, ModelName, Mileage, Price, Year)
VALUES
('BMW', '3 Series', 30000, 30000.00, 2019),
('Audi', 'A4', 15000, 35000.00, 2022);

 * postgresql://dbproject_iccs225_user:***@dpg-ct5gtalds78s73bnqkag-a.singapore-postgres.render.com/dbproject_iccs225
2 rows affected.

[]

In [16]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [17]:
%%sql
SELECT * FROM VehicleManagement;

 * postgresql://dbproject_iccs225_user:***@dpg-ct5gtalds78s73bnqkag-a.singapore-postgres.render.com/dbproject_iccs225
2 rows affected.

[(1, 'BMW', '3 Series', 30000, Decimal('30000.00'), 2019),
 (2, 'Audi', 'A4', 15000, Decimal('35000.00'), 2022)]